<?php
return [
    'login' => 'تسجيل الدخول',
    'login2' => 'تسجيل الدخول',
    'urchat' => 'دردشاتك',
    'username' => 'اسم المستخدم',
    'password' => 'كلمة المرور',
    'new_password' => 'كلمة المرور الجديدة',
    'reset_password' => 'إعادة تعيين كلمة المرور',
    'go_back_to_login' => 'الرجوع إلى تسجيل الدخول',

    'select_language' => 'اختر اللغة',
    'language' => 'اللغة', // مفتاح مضاف لزر التحميل
    'signup' => 'إنشاء حساب',
    'dont_have_account' => "ليس لديك حساب؟",
    'invalid_login' => 'اسم المستخدم أو كلمة المرور غير صحيحة.', // مفتاح مضاف لتسجيل دخول غير صالح
    'chat_with' => 'الدردشة مع %s', // سيتم استبدال %s باسم المستخدم
    'type_message' => 'اكتب رسالتك...',
    'send' => 'إرسال',
    'clear_chat' => 'مسح الدردشة',
    'back_to_users' => 'العودة إلى المستخدمين',
    'logout' => 'تسجيل الخروج',
    'language2' => "اختر اللغة",
    'select_user_to_chat' => "دردشة جديدة",
    'logout_confirmation' => "هل أنت متأكد أنك تريد تسجيل الخروج؟",
    'yes' => "نعم",
    'no' => "لا",
    'rselect_user_to_chat' => "إبلاغ من دردشة جديدة",
    'rurchat' => 'إبلاغ من دردشاتك',
    'report_user' => 'الإبلاغ عن مستخدم',
    'reason' => 'سبب الإبلاغ',
    'submit_report' => 'إرسال الإبلاغ',
    'reporting_user' => 'إبلاغ',
    'report_success' => 'تم إرسال الإبلاغ بنجاح',
    'report_fail' => 'لم يتم إرسال الإبلاغ',
    'reported_user' => 'المستخدمون المبلغ عنهم',
    'reported_users_list' => 'قائمة المستخدمين المبلغ عنهم',
    'reported_username' => 'اسم المستخدم المُبلغ عنه',
    'reason' => 'السبب',
    'timestamp' => 'تاريخ/وقت الإبلاغ',
    'no_reports' => 'لا توجد إبلاغات',
    'reported' => 'عرض المستخدمين المبلغ عنهم'

    // أضف المزيد من الترجمات حسب الحاجة...
];
